import type { TPayment, IBuyer } from '../../types';

class Buyer implements IBuyer {
  
  payment: TPayment;
  email: string;
  phone: string;
  address: string;

  constructor ( payment: TPayment,
                email: string,
                phone: string,
                address: string
              ) 
  {
    this.payment = payment;
    this.email = email;
    this.phone = phone;
    this.address = address;
  }

//Методы
  //сохранение данных в модели. Один общий метод или отдельные методы для каждого поля. Важно учесть, что должна быть реализована возможность сохранить только одно значение, например, только адрес или только телефон, не удалив при этом значения других полей, которые уже могут храниться в классе;
  //получение всех данных покупателя;
  //очистка данных покупателя;
  //валидация данных. Обратите внимание, что правила валидации описаны в функциональных требованиях. Поле является валидным, если оно не пустое. Метод валидации должен давать возможность определить не только валидность каждого отдельного поля, но и предоставлять информацию об ошибке, связанной с проверкой конкретного значения.
}
