import type { IProduct, TProductBasket } from '../../types';

class ProductBasket {
  
  protected productList: TProductBasket = {};

  constructor () {} ;

//Методы
//получение массива товаров, которые находятся в корзине;
//добавление товара, который был получен в параметре, в массив корзины;
//удаление товара, полученного в параметре из массива корзины;
//очистка корзины;
//получение стоимости всех товаров в корзине;
//получение количества товаров в корзине;
//проверка наличия товара в корзине по его id, полученного в параметр метода.
}
